# План:

# Місце - квест кімната.
# Рівень 1
# Рівень 2
# Рівень 3
# Кінець

# Блок-схема:

# Вступ intro() print
            # Вибір щодо початку гри - input
            # Якщо так, то рівень 1. Якщо ні, то програш. if/else
# Рівень 1: 
            # Опис гри “камінь - ножиці - папір”. print
            # Правильний вибір лише 1 з 3. input та  if/else
# Рівень 2: 
            # Опис загадки. print
            # Правильний вибір лише 1 з 3. input та  if/else
# Рівень 1: 
            # Опис гри “вгадай мелодію”. print
            # Правильний вибір лише 1 з 3. input та  if/else
# Виграш
# Програш

# Порівняльна характеристика:

# Для опису сюжету у моїй версії гри та версії ШІ використовується print. Для вибору користувача input і розгалужень if/else.
# Для сортування частин гри використовуються def - блок коду, який можна викликати у будь-якій частині гри.
# ШІ використав import random для випадковості у сюжеті. 
# random.randint(0, 1) == 0: - якщо випаде 0, то гравець перемагає монстра.


            
